#Напишите функцию, которая переставляет значения переменных «на месте>.'>
#(то есть без испол и:�ования временных переменных).


a = 3
b = 6

a += (b-a)/2

b -= (b-a) * 2
a += (a-b)

print(a,b)


x = 5
y = 12

x = x^y
y = x^y
x = x^y
print(x,y)



